## Basic Functions in Pandas

In [1]:
import pandas as pd
df = pd.read_csv('data.csv')

In [2]:
# Shape of the DataFrame
df.shape

(16, 4)

In [3]:
row, col = df.shape

In [4]:
row

16

In [5]:
col

4

In [7]:
# Top n-th rows
df.head()   # head() means 5 rows show

   id     name address  subject
0   1   Anower    feni     math
1   2    rohan    jime   bangle
2   3    sojev    feni  english
3   4    mikar    jime     math
4   5  kaelrer    feni  physics

In [9]:
df.head(3)

   id    name address  subject
0   1  Anower    feni     math
1   2   rohan    jime   bangle
2   3   sojev    feni  english

In [8]:
# last n-th rows
df.tail()

    id     name address  subject
11  12  opqwepw    jime  english
12  13  poineor    feni     math
13  14   kpaore    jime  physics
14  15  opjpoer    feni  english
15  16   poerer    jime     math

In [10]:
df.tail(3)

    id     name address  subject
13  14   kpaore    jime  physics
14  15  opjpoer    feni  english
15  16   poerer    jime     math

In [11]:
# range of entries
df[5:10]

   id       name address  subject
5   6  alier mia    jime  english
6   7     kameor    feni     math
7   8     kadsfe    jime  physics
8   9   yojerwer    feni  english
9  10    aerewre    jime     math

In [12]:
# accessing the columns
df.name

0        Anower
1         rohan
2         sojev
3         mikar
4       kaelrer
5     alier mia
6        kameor
7        kadsfe
8      yojerwer
9       aerewre
10     ewrwerwe
11      opqwepw
12      poineor
13       kpaore
14      opjpoer
15       poerer
Name: name, dtype: object

In [13]:
# another ways
df['name']

0        Anower
1         rohan
2         sojev
3         mikar
4       kaelrer
5     alier mia
6        kameor
7        kadsfe
8      yojerwer
9       aerewre
10     ewrwerwe
11      opqwepw
12      poineor
13       kpaore
14      opjpoer
15       poerer
Name: name, dtype: object

In [14]:
df.columns

Index(['id', 'name', 'address', 'subject'], dtype='object')

In [15]:
# accessing n-th columns
df[['name']]

         name
0      Anower
1       rohan
2       sojev
3       mikar
4     kaelrer
5   alier mia
6      kameor
7      kadsfe
8    yojerwer
9     aerewre
10   ewrwerwe
11    opqwepw
12    poineor
13     kpaore
14    opjpoer
15     poerer

In [19]:
df[['name', 'subject']].head()

      name  subject
0   Anower     math
1    rohan   bangle
2    sojev  english
3    mikar     math
4  kaelrer  physics

In [22]:
# type of column
type(df['name'])

pandas.core.series.Series

In [ ]:
# type of row
type(df['name'])